<a href="https://colab.research.google.com/github/ssunwalka01/Tripeur/blob/master/Tripeur_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Welcome !! To my Preprocessing Noteboook**

Importing the Libraries here...

In [0]:
import pandas as pd
import numpy as np
import re  # Importing regex library i.e. Regular Expressions

- Reading the dataset

In [0]:
data = pd.read_csv("/content/flight_Tripeur.csv")

##### Let's see the data

In [132]:
data.head(10)

  AIRLINE_CODE  FLIGHT_NO  ...                   DEP_TIME                  ARR_TIME
0          9W         393  ...       2018-09-19T22:45:00        2018-09-20T00:35:00
1          9W         444  ...       2018-09-19T14:00:00        2018-09-19T15:50:00
2          9W         444  ...   2018-09-19T14:00:00.000    2018-09-19T15:50:00.000
3          9W         393  ...   2018-09-19T22:45:00.000    2018-09-20T00:35:00.000
4          AI         640  ...       2018-09-19T06:45:00        2018-09-19T08:35:00
5          AI         640  ...   2018-09-19T06:45:00.000    2018-09-19T08:35:00.000
6          9W         450  ...       2018-09-19T11:35:00        2018-09-19T13:30:00
7          9W         444  ...   2018-09-19T14:00:00.000    2018-09-19T15:50:00.000
8          9W         393  ...   2018-09-19T22:45:00.000    2018-09-20T00:35:00.000
9          9W         450  ...   2018-09-19T11:35:00.000    2018-09-19T13:30:00.000

[10 rows x 5 columns]

In [133]:
# See the data-type
print(data.dtypes)

AIRLINE_CODE    object
FLIGHT_NO        int64
STOPS            int64
DEP_TIME        object
ARR_TIME        object
dtype: object

In [134]:
# Giving the Central Tendencies Measure
data.describe()

          FLIGHT_NO         STOPS
count  1.048575e+06  1.048575e+06
mean   1.043744e+03  1.807920e+00
std    1.526297e+03  5.739844e-01
min    1.000000e+01  1.000000e+00
25%    4.110000e+02  1.000000e+00
50%    6.550000e+02  2.000000e+00
75%    8.660000e+02  2.000000e+00
max    9.902000e+03  6.000000e+00

We have to preprocess the available dataset in the following form-

![Preprocessing](https://drive.google.com/file/d/1lXX7oKPu-wrOBYoKG3vIBzDkFw8WeWJf/view?usp=sharing)

- Make a new Column "FLIGHT_KEY" after Merging the "AIRLINE_CODE" and "FLIGHT_NO" columns.

In [0]:
data['FLIGHT_KEY'] = data.apply(lambda row: str(row.AIRLINE_CODE)+'_'+str(row.FLIGHT_NO), axis = 1)

- Now , I am going to split the observation like  2018-09-20T00:35:00.000 of "DEP_TIME" column into separate date and time fetures on the basis of split on 'T'.

In [0]:
data['DEP_TIME'] = data['DEP_TIME'].apply(lambda x : (x.split('T'))) # split() gives us the list of entries nows
data['ARR_TIME'] = data['ARR_TIME'].apply(lambda x : (x.split('T')))

Making new columns for Date and Time respectively.

In [0]:
data['DEPT_DATE'] = data.apply(lambda row: row.DEP_TIME[0], axis = 1) 
data['DEPT_TIMING'] = data.apply(lambda row: row.DEP_TIME[1], axis = 1)

In [0]:
data['ARR_DATE'] = data.apply(lambda row: row.ARR_TIME[0], axis = 1) 
data['ARR_TIMING'] = data.apply(lambda row: row.ARR_TIME[1], axis = 1)

Let' see the dataset again..

In [139]:
data.head()

  AIRLINE_CODE  FLIGHT_NO  STOPS  ...    DEPT_TIMING     ARR_DATE    ARR_TIMING
0          9W         393      1  ...      22:45:00    2018-09-20      00:35:00
1          9W         444      1  ...      14:00:00    2018-09-19      15:50:00
2          9W         444      1  ...  14:00:00.000    2018-09-19  15:50:00.000
3          9W         393      1  ...  22:45:00.000    2018-09-20  00:35:00.000
4          AI         640      1  ...      06:45:00    2018-09-19      08:35:00

[5 rows x 10 columns]

- Here, we could have used regex to re.split("operator1 | operator2") to split the entry for multiple delimiters, but, "." is present which is used as an Metacharacter (Use-Any character (except newline character)) in regex. So, I am going with a different approach.

- Replace " . " with " : " and then split using split() function

In [0]:
data['DEPT_TIMING'] = data.apply(lambda row: str(row.DEPT_TIMING).replace('.', ':'), axis = 1)
data['ARR_TIMING'] = data.apply(lambda row: str(row.ARR_TIMING).replace('.', ':'), axis = 1)

In [0]:
data['DEPT_TIMING'] = data['DEPT_TIMING'].apply(lambda x : (x.split(':'))) # split() gives us the list of entries nows
data['ARR_TIMING'] = data['ARR_TIMING'].apply(lambda x : (x.split(':')))

In [142]:
data['ARR_TIMING']

0               [00, 35, 00]
1               [15, 50, 00]
2          [15, 50, 00, 000]
3          [00, 35, 00, 000]
4               [08, 35, 00]
                 ...
1048570    [16, 20, 00, 000]
1048571    [18, 15, 00, 000]
1048572    [09, 25, 00, 000]
1048573    [10, 20, 00, 000]
1048574    [18, 15, 00, 000]
Name: ARR_TIMING, Length: 1048575, dtype: object

- As, we can see we have got a list of entries. Now, I am going to join them which will result in entries without " : "

In [0]:
data['DEPT_TIMING'] = data.apply(lambda x: (''.join(x.DEPT_TIMING)), axis = 1)
data['ARR_TIMING'] = data.apply(lambda x: (''.join(x.ARR_TIMING)), axis = 1)

In [144]:
data['DEPT_TIMING']

0             224500
1             140000
2          140000000
3          224500000
4             064500
              ...
1048570    100000000
1048571    113000000
1048572    022500000
1048573    022500000
1048574    100000000
Name: DEPT_TIMING, Length: 1048575, dtype: object

In [145]:
data['ARR_TIMING']

0             003500
1             155000
2          155000000
3          003500000
4             083500
             ...
1048570    162000000
1048571    181500000
1048572    092500000
1048573    102000000
1048574    181500000
Name: ARR_TIMING, Length: 1048575, dtype: object

- Here, Now I need to remove the Trailing Zeroes from the entries. On Analysis,I also found that there was whitespaces present after 0's. So, if we only use rstrip("0") to remove trailing zeroes we will not get the expected output and hence I am using rspilt("0| ").

In [0]:
data['ARR_TIMING'] = data['ARR_TIMING'].str.rstrip("0| ")
data['DEPT_TIMING'] = data['DEPT_TIMING'].str.rstrip("0| ")

In [147]:
data.head(10)

  AIRLINE_CODE  FLIGHT_NO  STOPS  ... DEPT_TIMING     ARR_DATE ARR_TIMING
0          9W         393      1  ...        2245   2018-09-20       0035
1          9W         444      1  ...          14   2018-09-19        155
2          9W         444      1  ...          14   2018-09-19        155
3          9W         393      1  ...        2245   2018-09-20       0035
4          AI         640      1  ...        0645   2018-09-19       0835
5          AI         640      1  ...        0645   2018-09-19       0835
6          9W         450      1  ...        1135   2018-09-19        133
7          9W         444      1  ...          14   2018-09-19        155
8          9W         393      1  ...        2245   2018-09-20       0035
9          9W         450      1  ...        1135   2018-09-19        133

[10 rows x 10 columns]

- Awesome!! Now, we only need ('FLIGHT_KEY', 'AIRLINE_CODE', 'STOPS', 'DEPT_TIMING', 'ARR_TIMING') columns in the final data followed by renaming DEPT_TIMING and ARR_TIMING as DEP_TIME, ARR_TIME respectively.

In [0]:
data_final = data.loc[:,['FLIGHT_KEY', 'AIRLINE_CODE', 'STOPS', 'DEPT_TIMING', 'ARR_TIMING']]

In [149]:
data_final.head(10)

  FLIGHT_KEY AIRLINE_CODE  STOPS DEPT_TIMING ARR_TIMING
0    9W _393          9W       1        2245       0035
1    9W _444          9W       1          14        155
2    9W _444          9W       1          14        155
3    9W _393          9W       1        2245       0035
4    AI _640          AI       1        0645       0835
5    AI _640          AI       1        0645       0835
6    9W _450          9W       1        1135        133
7    9W _444          9W       1          14        155
8    9W _393          9W       1        2245       0035
9    9W _450          9W       1        1135        133

In [0]:
data_final = data_final.rename(columns= {"DEPT_TIMING" : "DEP_TIME", "ARR_TIMING" : "ARR_TIME"})

In [151]:
data_final.head(10)

  FLIGHT_KEY AIRLINE_CODE  STOPS DEP_TIME ARR_TIME
0    9W _393          9W       1     2245     0035
1    9W _444          9W       1       14      155
2    9W _444          9W       1       14      155
3    9W _393          9W       1     2245     0035
4    AI _640          AI       1     0645     0835
5    AI _640          AI       1     0645     0835
6    9W _450          9W       1     1135      133
7    9W _444          9W       1       14      155
8    9W _393          9W       1     2245     0035
9    9W _450          9W       1     1135      133

# Wohoo !! We got the desired OUTPUT.

- Saving into csv format

In [0]:
data_final.to_csv('flight_Tripeur_Output.csv', index =False)

Thanks !!

- PS: This Notebook belongs to SHUBHAM KUMAR SUNWALKA
-  Dated: 08, November 2019


---



---



---